#learn from:http://mp.weixin.qq.com/s?__biz=MzA3MTM3NTA5Ng==&mid=2651057021&idx=1&sn=4da1328d3f54322a43a5b13dc61caebe&chksm=84d9caeab3ae43fc8ecf0f20502ccabcd7904bea05b9f2e99d4e41451d30d9b2f075dfb76329&mpshare=1&scene=1&srcid=11174LXcoMhvWBr6TAdowOpH#rd

#注释:
##文件注释、代码块注释


#命名规范


# 代码组织
# 版权申明
# 编码环境申明
# 作者注释
# 文件说明
# 项目目的
# 输入与输出说明
# 函数定义说明


#R编程的一般约定
#1.每行代码最长不超过80字符
#2.使用空格键空两格进行缩进，尽量不使用Tab键
#3.使用<-符号进行赋值，而不是=号
#4.在使用二次运算符时（+-=<-）两端都需要空一格
#5.逗号，逗号前不需要空一格，逗号后需要空一格
#6.分号，无特殊情况不要使用分号
#7.花括号，通常在循环语句或自定义函数中用到，左不换行写，右独占一行写
#8.尽量少用attach函数
#9.小括号，在前括号前加一个空格，但调用函数时除外，特指if等循环命令
#10.全部代码约定应保持一致
